/*
    এই ফাংশনটি শুধু ১৩ এর ঘরের নামতা প্রিন্ট করবে। 
    কিন্তু এমন সিস্টেমে এটাকে তৈরী করলাম, শুধু মাত্র প্যারামিটার এর ভ্যালু চেঞ্জ করলেই, ততো এর ঘরের নামতা প্রিন্ট হবে । 

    এখানে খেয়াল রাখতে হবে, ১৩ কে বা যে কোন সংখ্যা কে , আমাদের লুপ এর i এর মান দিয়ে
    বার বার গুন করতে হবে। ধরেনঃ ১৩*১ = ১৩ [ এখানে, ১ হলো লুপের i এর মান]
*/

function multiplicationTable(number)
{
    for(var i=1; i<=10;i++)
    {
        console.log(number," * "+i+" = ",number*i);
    }
}

var number = 13;
multiplicationTable(number);