/*
		আমরা সাধারন ভাবে ইয়ার কে ৪ দারা ভাগ করে যেভাবে লিপ ইয়ার নির্নয় করি, সেটি ১০০% সঠিক তথ্য প্রদান করেনা।
		তাই , এখানে প্রোগ্রামটি এমন ভাবে ক্রিয়েট করা হয়েছে , যেন সফল ভাবে লিপ ইয়ার নির্নয় করতে পারে।
		
		ধারনাঃ পৃথিবী ৩৬৫ দিন ৫ঘন্টা ৪৮ মিনিট ৪৭ সেকেন্ডে সেকেন্ডে সূর্যকে ১বার পরিক্রমন করে। ৩৬৫ দিনের সাথে অতিরিক্ত যে সময় টা থেকে 
		যায়, ওই সময় গুলো ৪বছর পর যোগ করলে একটি পূর্ন দিন সৃষ্টি হয়। আর সেই পূর্ন দিনটি ফ্রেব্রুয়ারী মাসের সাথে যোগ করা হয়।
		যে সালের ফেব্রুয়ারী মাস ২৯ দিনে হয় , সেই সালকে লিপ ইয়ার বলা হয়। 
		
		এক কথায়, 
		১। কোন সাল যদি ৪০০ দ্বারা ভাগ করার পর , নিঃশেষে বিভাজ্য হয় তাহলে তাকে লিপ ইয়ার বলা হয়।
		২।  আর যদি ৪০০ দ্বারা ভাগ করার পর , নিঃশেষে বিভাজ্য না হয়, 
		তখন 
		সালটি ৪ দ্বারা ভাগ করার পর নিঃশেষে বিভাজ্য হলে এবং ১০০ দারা ভাগ করার পর নিঃশেষে বিভাজ্য না হলে  , সালটিকে ও লিপ ইয়ার 
		বলা হয়। 
*/

function leapYear(year){

    if((year%400 == 0) || ((year%4 == 0) && (year%100!=0))){
       console.log("Leap year ");
    }else{
     console.log("Not a leap year ");
    }
}

leapYear(2006);


console.log("==============অন্যভাবে  ===========");

function leap(year){
 
 if(year%400 == 0){
     console.log("Leap year ");
 }else if(year%100!=0 && year%4 == 0){
     console.log("leap year ");
 }else{
     console.log("This is not a leap year");
 }
}

leap(2000);